app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2023-05-25 08:28:21.934117"], ["updated_at", "2023-05-25 08:28:21.934117"]]
---
  def create
    @room = Room.create(name: params["room"]["name"])

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @single_room = Room.find(params[:id])