app/models/room.rb

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "private_1_2"], ["is_private", 1], ["created_at", "2023-05-25 11:47:40.094163"], ["updated_at", "2023-05-25 11:47:40.094163"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 7], ["created_at", "2023-05-25 11:47:40.121500"], ["updated_at", "2023-05-25 11:47:40.121500"]]
---
	def self.create_private_room(users, room_name)
  		single_room = Room.create(name: room_name, is_private: true)
  		users.each do |user|
    	Participant.create(user_id: user.id, room_id: single_room.id )